Repository: magi1125/inclusive-design-pattern
Catalog: tm/chapter-13_EN-US_JA.tmx
Source language: en_us
Languages: ja

source: But the easiest way (that I’m aware of) to compose closed captions is to use YouTube’s intuitive GUI, for which Google offers a help page27 to get you started.
ja: しかし、クローズドキャプションを作成する最も簡単である（と私が感じている）方法は、YouTubeの直感的なGUIを使用することです。Googleが、その使い方を説明したヘルプページ（脚注60）を提供しています。

source: There are certain conventions you should follow when writing captions.
ja: キャプションを書くときは、従うべき規則があります。

source: The most important of these are to identify:
ja: 中でも最も重要なのが以下の特定です。

source: •Changes of speaker
ja: 1.話し手の変更

source: •Background/incidental sound
ja: 2.背景音／偶発的な音

source: Speaker Identification and Sound Effects
ja: 話し手の特定とサウンドエフェクト

source: Let’s say our video involves two men called Simon and Rupert.
ja: ビデオにサイモン（Simon）とルパート（Rupert）という2人の男性が登場するとしましょう。

source: They’re sitting at a table in a pub.
ja: 2人はパブで席に座っています。

source: Simon begins the conversation by claiming that the daddy long-legs spider28 has the world’s most poisonous venom and continues to describe how the spider is, nevertheless, harmless because its teeth are not strong enough to pierce human skin.
ja: サイモンが、ユウレイグモ（脚注61）は世界で最も強い毒を持っていると話し、会話を始めます。続けて彼は、とは言え、そのクモの歯は人間の肌を刺せるほど強くないため害はない、と説明します。

source: He means fangs, of course.
ja: もちろん彼は毒牙のことを言っています。

source: Imagine a spider with teeth!
ja: 歯があるクモを想像してみてください！

source: In the following illustration, I’ve chosen to identify the speaker with their name written in capital letters.
ja: 以下の図では、大文字で名前を書くことによって、話し手を特定することにしました。

source: This is not the only way to identify speakers, but whatever convention you use, make sure it is consistent.
ja: これが話し手を区別する唯一の方法ではありませんが、どんな決まりを使う場合でも、必ず一貫したものにしてください。

source: Note that the name is not needed for the second caption as the speaker has not changed. Two frames.
ja: 話し手が変わっていないため、2番目のキャプションには名前は不要です。

source: Rupert is aware that this factoid is just an internet rumor and interjects to correct Simon on his false claim29.
ja: ルパートは、この擬似事実が単なるインターネット上の噂であると知っていて、彼の間違った主張を正すため、サイモンの話を遮ります。（脚注62）

source: Since Rupert is a new speaker, he must be identified.
ja: ルパートが新しい話し手であるため、彼を特定する必要があります。

source: We use the same convention. Two frames.
ja: これには先ほどと同じ規則を使います。

source: Before Rupert can finish his sentence, the two speakers are interrupted by a loud crash as the barman drops a glass (out of frame).
ja: ルパートが話し終わる前に、バーテンダー（barman）がグラスを落としたため（フレーム外）、2人の話は遮られます。

source: Often, the description of such a noise is both in caps and bookended by [ and ] (square brackets).
ja: 多くの場合、このような雑音の説明はキャプションと[ ]（角括弧）で囲むことによって示されます。

source: The barman immediately apologizes.
ja: バーテンダーは、すぐに謝ります。

source: I identify that he is out of frame by prefixing a greater-than symbol.
ja: 私は彼がフレーム外にいることを、大なり記号を先頭に付けることで示しました。

source: The BBC provides extensive guidelines30 on different options to identify speakers, announcements, sounds, music, and much more.
ja: BBCは話し手、アナウンス、音、音楽などを示すためのさまざまな方法について広範なガイドラインを提供しています。（脚注63）

source: The Transcript
ja: トランスクリプト

source: The transcript would form the main textual content of your video posting.
ja: トランスクリプトは、ビデオポストのメインのテキストコンテンツを形成します。

source: Sometimes it’s easier to write the transcript first, then turn the transcript into captions.
ja: 先にトランスクリプトを書き、それをキャプションに変えた方が楽な場合もあります。

source: In any case, it should take the form of a linearized version of the captions.
ja: どちらにしても、キャプションを直線的にした形をとります。

source: The only substitution I have made, for clarity where there is no visual context, is that the barman is identified as being out of shot:
ja: ここで行った唯一の置き換えは、視覚的なコンテキストがない状態で明確に伝えるために、バーテンダーがショットの外側にいると示したことです。

source: SIMON: “Did you know the daddy long-legs spider is the most poisonous creature in the world?
ja: SIMON: 「ユウレイグモが世界で一番強い毒を持つ生き物だって知っていた？

source: The thing is, though, they can’t bite you because their teeth are too weak.”
ja: だけど実際は、歯が弱すぎて人は噛めないんだ」

source: RUPERT: “Well, actually—”
ja: RUPERT: 「ええと、本当は…」

source: [GLASS BREAKING]
ja: [グラスの割れる音]

source: BARMAN (out of shot): “Sorry about that!”
ja: BARMAN（ショット外）：「失礼しました！」

source: Establishing A Flow System
ja: フローシステムの確立

source: Inclusive web design isn’t just about providing robust, accessible experiences for users.
ja: インクルーシブなWebデザインの目的は、ユーザーに堅牢でアクセシブルな体験を提供することだけではありません。

source: It’s also about facilitating and easing the contribution of content by site owners and editors.
ja: サイトのオーナーや編集者の役割を容易化することも目的です。

source: Like a grid system, a flow system uses CSS to manage layout.
ja: グリッドシステムと同じく、フローシステムはCSSを使用してレイアウトを処理します。

source: Unlike a grid system, a flow system deals with the relations between flow elements which appear one after another in a single column — headings, paragraphs, lists, images, videos, and so on.
ja: グリッドシステムとは異なり、フローシステムは、1つのカラムに順々に表示される、見出し、パラグラフ、リスト、画像、ビデオなどのフロー要素間の関係を処理します。

source: A good flow system produces a regular, well-spaced, readable procession of elements regardless of their order and combination.
ja: 優れたフローシステムは、順序や組み合わせに関わらず、規則的で十分な間隔があり、読みやすい要素の連続を生成します。

source: This gives editors the freedom to just go ahead and write.
ja: これにより、編集者は自由に書くことができます。

source: Everything Divisible by line-height
ja: すべてはLINE-HEIGHTで分割できる

source: Though a strict vertical rhythm31 is notoriously tough to establish and maintain, it’s good practice to at least use your paragraph line height as a basis for vertical spacing.
ja: 厳密なバーティカルリズム（脚注64）は確立や維持が難しいことで知られていますが、少なくとも縦の間隔のベースとしてパラグラフの行高さを使用すると良いでしょう。

source: So, if paragraphs have a line-height of 1.5, one unit of vertical whitespace should be 1.5em.
ja: つまり、パラグラフのline-heightが1.5の場合、縦の空白の1単位を1.5remにします。

source: To enforce a regularity independent of the flow elements incorporated in the editor’s WYSIWYG or Markdown editor, this basic spacing should be applied generally, with just a few exceptions.
ja: 編集者のWYSIWYGエディタまたはMarkdownエディタに組み込まれたフロー要素に関係なく規則的にするために、少数の例外を除き、この基本の間隔を全体に適用します。

source: Note the use of the owl selector32 in the first line.
ja: 最初の行でowlセレクタ（脚注65）が使用されていることに注目してください。

source: This ensures that top margins only occur between successive elements.
ja: これにより、上余白は後続の要素との間にのみ発生します。

source: If instead we applied margin directly to elements, there would be the danger of it doubling up with the padding of containers:
ja: 代わりに余白を要素に直接適用した場合、コンテナのパディングと二重になる危険があります。

source: .container { padding: 1.5rem; } .container p { margin-top: 1.5rem; } /* visible space inside top of .container would now be 3em */
ja: .container { padding: 1.5rem; } .container p { margin-top: 1.5rem;V } /* .containerの上部内に表示されるスペースが3remになります*/

source: Grouping and Separation
ja: グループ化と分離

source: Currently, every flow element is separated by the same 1.5em margin, with a few exceptions.
ja: 現在、いくつかの例外を除いて、すべてのフロー要素は同じ1.5remの余白で区切られています。

source: List items (<li>s) do not take margin at all and consequently look grouped together.
ja: リスト項目（<li>）は余白をまったく取らないため、グループ化されているように見えます。

source: So they should: for the sake of comprehension on the part of the reader, related elements should be visually proximate.
ja: リスト項目はこうあるべきです。読者側の理解を助けるために、関連する要素を視覚的に近似させる必要があります。

source: By changing the unit of measurement from rem to em, we can achieve a similar effect for subsections of content within our blog: a margin set in em on a heading will be relative to its own font size.
ja: サイズの単位をremからemに変更することで、ブログ内のコンテンツのサブセクションの場合と同じような効果を作成できます。つまり、emで設定した見出しの余白は、それ自体のフォントサイズと相対的になります。

source: Since heading text is larger than body text, this means the heading will appear closer to the content introduced below it.
ja: 見出しテキストは本体テキストよりも大きいため、見出しは下に続くコンテンツの方に近づいた見た目になります。

source: * + h2, * + h3 { /* em, not rem, now */ margin-top: 1.5em; }
ja: * + h2, * + h3{ /* 今度はremではなくem*/ margin-top: 1.5em; }

source: To separate supplementary content such as blockquotes and illustrations from the paragraph text, you can apply a greater margin for anything that isn’t a <p>:
ja: 引用やイラストなどの補足的なコンテンツをパラグラフテキストから分離するには、以下のように<p>以外のすべてで余白を大きくします。

source: To maintain vertical rhythm, a multiple of our paragraph line height is used (1.5 × 2 = 3).
ja: バーティカルリズムを維持するため、パラグラフの行高さの倍数を使用します（1.5 × 2 = 3）。

source: Note that the standard 1.5rem top margin of the element following will be superseded, resulting in a 3rem margin as prescribed both above and below the element in question.
ja: 要素の標準の1.5remの上余白の代わりに、要素の上下両方で余白が所定の3remとなります。

source: This is thanks to collapsing margin behavior33.
ja: これは、マージンの相殺のおかげです。（脚注66）

source: The editor can insert a <blockquote>, <figure>, <audio> or any other element and the spacing will still communicate a break from the prose.
ja: 編集者は、<blockquote>、<figure>、<audio>またはその他の要素を挿入でき、間隔が文章の小休止を伝えます。

source: Successive paragraphs have less margin between them than paragraphs and other elements.
ja: 連続するパラグラフでは、パラグラフとその他の要素の間に比べて、間の余白が小さくなります。

source: In CSS, there’s little more inclusive than the universal (star) selector.
ja: ？？CSSでは、ユニバーサルセレクタ（*）よりもう少しインクルーシブです。？？【コメント：この解釈で問題ないでしょうか。原文「InCSS,there’slittlemoreinclusivethantheuniversal(star) selector.」】

source: It can help us manage content and its interrelationships inclusively.
ja: これは、コンテンツとその相互関係をインクルーシブに管理するのに役立ちます。

source: A Note on Defensive Coding
ja: 防御的なコーディングについて

source: I’ve always found the term WYSIWYG (what you see is what you get) a bit misleading, since WYSIWYG editors almost invariably have a habit of leaving lots of undesired, invisible junk in the source.
ja: WYSIWYG（what you see is what you get：？？最終的なアウトプットのスタイルのまま編集できる？？）という言葉が少し誤解されているのをよく目にします。【コメント：補足しました】WYSIWYGエディタでは、ほぼ必ず、ソース内に不要な非表示のゴミがたくさん残ります。

source: <p></p> <p></p> <p></p> <p></p> <!-- ad infinitum -->
ja: <p></p> <p></p> <p></p> <!-- 際限なく続く-->

source: In some circumstances this can have an impact on the spacing and vertical rhythm of the rendered content.
ja: 特定の環境で、これは表示されるコンテンツの間隔やバーティカルリズムに影響することがあります。

source: We can employ some defensive coding here to remove empty elements from the flow.
ja: ここでは防御的なコーディングを採用して、フローから空の要素を取り除きましょう。

source: The display:none; declaration eliminates the element’s layout, including any margins attributed to it.
ja: display:none;宣言は、要素のレイアウト（それにより発生する余白を含む）を非表示にします。

source: In general, it’s best to encourage the creation of semantic, well-structured content with a syntax like Markdown34 or Textile35.
ja: 一般に、Markdown（脚注67）やTextile（脚注68）のような構文を使用して、セマンティックで十分に構造化されたコンテンツを作成することを推奨するのがベストです。

source: They offer a simple syntax which corresponds to semantic HTML elements such as headings and list items.
ja: これらは見出しやリスト項目などのセマンティックなHTML要素に対応するシンプルな構文を提供しています。

source: Where needed, most editors (like the Penflip36 editor used to write this book) also allow raw HTML input, meaning editors versed in HTML have the option to add more complex content.
ja: 必要に応じて、ほとんどのエディタ（本書の執筆に使用したPenflip（脚注69）エディタなど）で未加工のHTMLを入力できます。これは、HTMLに詳しい編集者には、より複雑なコンテンツを追加する選択肢があるということです。

source: In lieu of training editorial staff to make the switch to structured content and to patch legacy WYSIWYG-based systems, a defensive strategy can help reduce headaches.
ja: 編集スタッフに、構造化されたコンテンツへの切り替えや、レガシーなWYSIWYGベースのシステムにパッチを適用する方法を教育する代わりに、防御的な戦略をとれば、頭痛も和らぐでしょう。

source: Time spent fixing layout bugs when entering content is wasted time and contributes to a frustrating and alienating editorial experience.
ja: コンテンツの入力時にレイアウトのバグを修正するのに費やす時間は無駄であり、編集体験をストレスのたまるとっつきにくいものにする原因となります。

source: Summary
ja: まとめ

source: In the conception of our blog post pattern, I covered one of the most fundamental aspects of inclusive design: structure.
ja: ブログ記事パターンの構想の中で、インクルーシブデザインの最も基本的な側面である、構造について説明しました。

source: By incorporating accessible landmarks and a sound section structure, the content — blog post or otherwise — becomes more navigable and interoperable by a diversity of users and parsers.
ja: アクセシブルなランドマークと音声セクション構造を組み込むことで、ブログ記事やその他のコンテンツは、多様なユーザーやパーサーがナビゲートしやすいものになり、相互運用性が向上します。

source: This is bolstered by giving well-written and context-independent structural and navigational cues.
ja: これは、適切に書かれた、コンテキスト非依存の構造およびナビゲーションの手掛かりを提供することでさらに強化されます。

source: We then moved on to supplementing this robust structure with additional media such as video.
ja: さらに、この堅牢な構造を、ビデオなどの追加のメディアで補完する方法も説明しました。

source: Not just one structure but an infinite number of legitimate configurations of body text, headings and media elements were catered for in our robust and inclusive CSS flow system.
ja: 私たちの堅牢でインクルーシブなCSSフローシステムでは、本文テキスト、見出し、およびメディア要素の適切な構成が、1つではなく無限に提供されています。

source: This ensured that editors would be able to write freely without having to worry about breaking the visual design.
ja: これにより、編集者は視覚的なデザインを壊すことを心配せずに、自由に書くことができます。

source: Things to Avoid
ja: 避けるべきこと

source: •A lack of navigable, structural cues or bypass blocks37 like landmarks and headings.
ja: • ランドマークや見出しなど、ナビゲート可能な構造的な手掛かりやブロックのバイパスがない。（脚注70）

source: •Whimsical, cryptic or partial labels for headings and links.
ja: • 見出しやリンクに風変わりなラベルやもったいぶったラベル、または部分的なラベルを付ける。

source: •CSS margin declarations not tolerant of and reactive to changing contexts.
ja: • コンテキストの変更に対して敏感で、寛容ではないCSSの余白の宣言。

source: •Making your static content site dependent on client-side JavaScript.
ja: • 静的なコンテンツサイトをクライアント側のJavaScriptに依存させる。

source: 1.http://www.heydonworks.com/article/flexbox-grid-finesse 2.http://www.heydonworks.com/article/screen-reader-strategy-survey 3.https://www.paciellogroup.com/blog/2013/10/html5-document-outline/ 4.https://developer.mozilla.org/en-US/docs/Web/HTML/Element/hgroup#Browser_compatibility 5.https://www.paciellogroup.com/blog/2015/01/the-browser-accessibility-tree/ 6.https://www.smashingmagazine.com/2011/08/html5-and-the-document-outlining-algorithm/ 7.https://www.paciellogroup.com/blog/2013/10/html5-document-outline/ 8.https://www.youtube.com/watch?v=CUkMCQR4TpY 9.https://gds.blog.gov.uk/ 10.https://curl.haxx.se/docs/httpscripting.html 11.http://tantek.com/ 12.http://tantek.com/2015/069/t1/js-dr-javascript-required-dead 13.https://www.smashingmagazine.com/ 14.https://en.wikipedia.org/wiki/Flesch%E2%80%93Kincaid_readability_tests 15.https://chrome.google.com/webstore/detail/tray-readability-tool/eccbjfaplogblgjpopbihpgfgmlgjamf?hl=en-GB 16.https://github.com/Heydon/readabilityCheckerCLI 17.http://tenon.io/ 18.http://www.nvaccess.org/ 19.http://www.deque.com/blog/accessibility-testing-nvda-screenreader/ 20.http://webaim.org/resources/shortcuts/nvda 21.http://www.heydonworks.com/article/responses-to-the-screen-reader-strategy-survey 22.https://ableplayer.github.io/ableplayer/ 23.https://github.com/paypal/accessible-html5-video-player 24.https://ind.ie/blog/accessible-video-player/ 25.https://www.sitepoint.com/comprehensive-look-html5-track-element/ 26.https://w3c.github.io/webvtt/#styling 27.https://support.google.com/youtube/answer/2734796?hl=en-GB 28.https://en.wikipedia.org/wiki/Pholcidae 29.http://www.livescience.com/33625-daddy-longlegs-spiders-poisonous.html 30.http://bbc.github.io/subtitle-guidelines 31.http://blog.8thlight.com/chris-peak/2012/12/30/vertical-rhythm.html 32.http://alistapart.com/article/axiomatic-css-and-lobotomized-owls 33.https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_Box_Model/Mastering_margin_collapsing 34.https://en.wikipedia.org/wiki/Markdown 35.http://txstyle.org/ 36.https://www.penflip.com/ 37.https://www.w3.org/TR/UNDERSTANDING-WCAG20/navigation-mechanisms-skip.html
ja: 36 http://www.heydonworks.com/article/flexbox-grid-finesse 37 http://smashed.by/srsurvey 38 http://smashed.by/html5doc 39 http://smashed.by/hgroup 40 http://smashed.by/a11ytree 41 http://smashed.by/html5outline 42 http://smashed.by/html5doc 43 https://www.youtube.com/watch?v=CUkMCQR4TpY 44 https://gds.blog.gov.uk/ 45 https://curl.haxx.se/docs/httpscripting.html 46 http://tantek.com/2015/069/t1/js-dr-javascript-required-dead 47 http://smashed.by/flesch 48 http://smashed.by/tray 49 https://github.com/Heydon/readabilityCheckerCLI 50 http://tenon.io/ 51 http://www.nvaccess.org/ 52 http://smashed.by/nvdatesting 53 http://webaim.org/resources/shortcuts/nvda 54 http://smashed.by/srsurvey 55 https://ableplayer.github.io/ableplayer/ 56 https://github.com/paypal/accessible-html5-video-player 57 https://ind.ie/blog/accessible-video-player/ 58 http://smashed.by/html5track 59 https://w3c.github.io/webvtt/#styling 60 https://support.google.com/youtube/answer/2734796?hl=en-GB 61 https://en.wikipedia.org/wiki/Pholcidae 62 http://smashed.by/livescience 63 http://bbc.github.io/subtitle-guidelines 64 http://smashed.by/verhythm 65 http://alistapart.com/article/axiomatic-css-and-lobotomized-owls 66 http://smashed.by/cssbox 67 https://en.wikipedia.org/wiki/Markdown 68 http://txstyle.org/ 69 https://www.penflip.com/ 70 http://smashed.by/navskip
